app/controllers/todos_controller.rb

  def update
    if @todo.update_attributes(todo_params)
---
UPDATE "todos" SET "title" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["title", "dsfsfsfsfsdfsdf"], ["updated_at", "2018-06-25 20:41:47.131435"], ["id", 9]]

  def complete
    done = !@todo.done
    @todo.update_attributes(:done => done)
---
UPDATE "todos" SET "done" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["done", "t"], ["updated_at", "2018-06-27 10:41:26.917959"], ["id", 9]]

  def create
    @todo = Todo.new(todo_params)
    if @todo.save
---
INSERT INTO "todos" ("title", "due_date", "note", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "vfcdfgfd"], ["due_date", "2017-12-25"], ["note", "dfklfds"], ["created_at", "2017-11-23 19:14:14.543551"], ["updated_at", "2017-11-23 19:14:14.543551"]]